# Lógica de Código Pyplan

### Pacotes

In [1]:
import os as os
import numpy as np
import pandas as pd
import xarray as xr

#### Valor Percentual

In [2]:
# Valor Percentual = (Atual - Anterior)/Anterior 
atual = 30000
anterior = 50000
valor_percentual = ((atual - anterior)/anterior) * 100
str(valor_percentual) + ' %'

'-40.0 %'

#### Defininindo um Index com Compreensão de lista (List comprehension)

In [3]:
data  = {'Coluna1':['Regional1'],  'Coluna2':['Região Leste'], 'Coluna3':['Atacado'], 'vol_dia':[10000]}
_df = pd.DataFrame(data)
_df

     Coluna1       Coluna2  Coluna3  vol_dia
0  Regional1  Região Leste  Atacado    10000

In [4]:
_df.set_index(['Coluna1', 'Coluna2', 'Coluna3', 'vol_dia'])

Empty DataFrame
Columns: []
Index: [(Regional1, Região Leste, Atacado, 10000)]

In [5]:
_df.set_index([col for col in _df if col != 'vol_dia'])

                                vol_dia
Coluna1   Coluna2      Coluna3
Regional1 Região Leste Atacado    10000

#### Deletando Colunas

In [6]:
data = {'col1':[1,2], 'col2':[1,2], 'col3':[1,2]}
_df = pd.DataFrame(data)
_df

   col1  col2  col3
0     1     1     1
1     2     2     2

In [7]:
_df = _df.drop(columns=['col3'])
_df

   col1  col2
0     1     1
1     2     2

In [8]:
del _df['col2']
_df

   col1
0     1
1     2

In [9]:
_df.insert(loc=1, column='MesTime', value=['2021.01','2021.02'])
_df

   col1  MesTime
0     1  2021.01
1     2  2021.02

In [10]:
_datas = {'2021.01':'jan', '2021.02':'fev'}
_df = _df.replace({'MesTime':_datas})
_df

   col1 MesTime
0     1     jan
1     2     fev

#### Filtros

In [11]:
_df[ (_df['col1']==1) & (_df['MesTime']=='jan') ]

   col1 MesTime
0     1     jan

In [12]:
_list = ['fev']
_df[ _df['MesTime'].isin(_list)]

   col1 MesTime
1     2     fev

In [13]:
_df.query(" MesTime == 'jan' ")

   col1 MesTime
0     1     jan

In [14]:
_df.query(" MesTime == 'jan' ")

   col1 MesTime
0     1     jan

In [15]:
_df

   col1 MesTime
0     1     jan
1     2     fev

In [16]:
_list = [1]
_df.query(" col1 in @_list ")

   col1 MesTime
0     1     jan

#### Função MAP

In [17]:
_df

   col1 MesTime
0     1     jan
1     2     fev

In [18]:
_df['col1'] = _df['col1'].map(lambda value: value**2)
_df

   col1 MesTime
0     1     jan
1     4     fev

#### Função FILTER

In [19]:
_df.filter(['col1'])

   col1
0     1
1     4

In [20]:
_df.filter(items=['col1'])

   col1
0     1
1     4

In [21]:
_df.filter(regex='es', axis=1)

  MesTime
0     jan
1     fev

In [22]:
_df.filter(like='0', axis=0)

   col1 MesTime
0     1     jan

#### DataFrames

In [23]:
# array is rows not columns, the coluns is the values inside of array.
# [0,1,2,3]
# [1,8,3,0]
# [2,9,3,0]
# [3,2,3,0]

data = np.array([ [0,1,2,3], [1,8,3,0], [2,9,3,0], [3,2,3,0] ]) 
_df1 = pd.DataFrame(data, columns=['id', 'col1', 'col2', 'col3'])
_df1

   id  col1  col2  col3
0   0     1     2     3
1   1     8     3     0
2   2     9     3     0
3   3     2     3     0

In [24]:
data = np.array([[0,1,2,3], [1,1,2,8], [2,5,2,4], [3,9,6,8]])
_df2 = pd.DataFrame(data, columns=['id', 'col4', 'col5', 'col6'])
_df2

   id  col4  col5  col6
0   0     1     2     3
1   1     1     2     8
2   2     5     2     4
3   3     9     6     8

#### Mesclando Dataframes

In [25]:
                    
_df = _df1.merge(_df2, on=['id'], how='left')
_df

   id  col1  col2  col3  col4  col5  col6
0   0     1     2     3     1     2     3
1   1     8     3     0     1     2     8
2   2     9     3     0     5     2     4
3   3     2     3     0     9     6     8

#### Pivotando Dataframes

In [26]:
_df_pivot = pd.pivot_table(_df,
                           values='col3', 
                           index='id',
                           columns=['col1'], 
                           aggfunc=np.sum).reset_index()

_df_pivot

col1  id    1    2    8    9
0      0  3.0  NaN  NaN  NaN
1      1  NaN  NaN  0.0  NaN
2      2  NaN  NaN  NaN  0.0
3      3  NaN  0.0  NaN  NaN

In [27]:
_df_pivot = _df_pivot.fillna(0)
_df_pivot

col1  id    1    2    8    9
0      0  3.0  0.0  0.0  0.0
1      1  0.0  0.0  0.0  0.0
2      2  0.0  0.0  0.0  0.0
3      3  0.0  0.0  0.0  0.0

In [28]:
_df_melt = pd.melt(_df_pivot, id_vars=['col1'], value_vars=['1'])
_df_melt

KeyError: "The following 'id_vars' are not present in the DataFrame: ['col1']"

#### Substituindo Valores

In [ ]:
data  = {'Coluna1':['Regional1'],  'Coluna2':['Região Leste'], 'Coluna3':['Atacado'], 'vol_dia':[10000]}
_df = pd.DataFrame(data)
_df

     Coluna1       Coluna2  Coluna3  vol_dia
0  Regional1  Região Leste  Atacado    10000

In [ ]:
_df['vol_dia'] = np.where(_df['vol_dia']== 1000, True, False)
_df

     Coluna1       Coluna2  Coluna3  vol_dia
0  Regional1  Região Leste  Atacado    False

In [ ]:
data  = {'Coluna1':['Regional1'],  'Coluna2':['Região Leste'], 'Coluna3':['Atacado'], 'vol_dia':[10000]}
_df = pd.DataFrame(data)
_df

     Coluna1       Coluna2  Coluna3  vol_dia
0  Regional1  Região Leste  Atacado    10000

In [ ]:
_df['vol_dia'] = np.where(_df['vol_dia']== 10000, True, False)
_df

     Coluna1       Coluna2  Coluna3  vol_dia
0  Regional1  Região Leste  Atacado     True

In [ ]:
_df = _df.replace('Regional1','Regional2')
_df

     Coluna1       Coluna2  Coluna3  vol_dia
0  Regional2  Região Leste  Atacado     True

In [ ]:
_df = _df.replace('Região Leste','Região Leste Cambuci2 66')
_df

     Coluna1                   Coluna2  Coluna3  vol_dia
0  Regional2  Região Leste Cambuci2 66  Atacado     True

#### Strings

In [ ]:
_df['Coluna2'].str.split(pat=' ')

0    [Região, Leste, Cambuci2, 66]
Name: Coluna2, dtype: object

In [ ]:
_df['Coluna2'].str.split(n=5, expand=True)

        0      1         2   3
0  Região  Leste  Cambuci2  66

In [ ]:
_df['Coluna2'].str.split(n=1)

0    [Região, Leste Cambuci2 66]
Name: Coluna2, dtype: object

In [ ]:
_df['split_cols'] = _df['Coluna2'].str.split(pat=' ').str[0]
_df

     Coluna1                   Coluna2  Coluna3  vol_dia split_cols
0  Regional2  Região Leste Cambuci2 66  Atacado     True     Região

In [ ]:
_df['split_cols'] = _df['Coluna2'].str.split(pat=' ').str[1]
_df

     Coluna1                   Coluna2  Coluna3  vol_dia split_cols
0  Regional2  Região Leste Cambuci2 66  Atacado     True      Leste

In [ ]:
_df['split_cols'] = _df['Coluna2'].str.split(pat=' ').str[0]
_df

     Coluna1                   Coluna2  Coluna3  vol_dia split_cols
0  Regional2  Região Leste Cambuci2 66  Atacado     True     Região

#### Criando Index e Atribuindo um dicionário

In [ ]:
data  = {'Coluna1':['Regional 1', 'Regional 2', ''],  'Coluna2':['Região Leste', 'Região Norte', ''], 'Coluna3':['Atacado', 'Atacado', ''], 'vol_dia':[10000, 500, 562]}
_df = pd.DataFrame(data)
_df

      Coluna1       Coluna2  Coluna3  vol_dia
0  Regional 1  Região Leste  Atacado    10000
1  Regional 2  Região Norte  Atacado      500
2                                         562

In [ ]:
pd.Index(_df.reset_index()['Coluna1'].unique().tolist())

Index(['Regional 1', 'Regional 2', ''], dtype='object')

In [ ]:
pd.Index([1 ,2 , 3])

Int64Index([1, 2, 3], dtype='int64')

In [ ]:
pd.Index(range(1,31,1))

RangeIndex(start=1, stop=31, step=1)

In [ ]:
index = pd.Index([
    # Moinhos > Cimento
    '[A1] Dias Úteis',
    '[B1] Dias Cobertura Cimento',
    '[C1] Demanda Comercial de Cimento',
    '[D1] Capacidade Total Moinhos',
    '[E1] Estoque Inicial = [N1]',
    '[F1] Estoque de Segurança =  [C1/A1 * B1]',
    '[G1] Entrada de Estoque = MAX[0, F1 - E1]',
    '[H1] Saída de Estoque =  MIN[0, F1 - E1]',
    '[I1] Requisito de Estoque = [G1 + H1]',
    '[J1] Requisito Total de Produção = [J1 + C1]',
    '[L1] Produção Planejada de Cimento = MAX[J1,D1]',
    '[M1] Cimento Disponível = [E1 + A3 - F1]',
    '[N1] Estoque Final = [E1 + A3 - C3]',
    '[O1] Alerta de Estoque Cimento',
    # Fornos > Clinquer
    '[A2] Dias Cobertura Clínquer',
    '[B2] Percentual de Clínquer',
    '[C2] Demanda de Clínquer para Cimento = [L1 * B2]',
    '[D2] Capacidade Total Fornos',
    '[E2] Estoque Inicial = [Q2]',
    '[F2] Estoque de Segurança = [C2/A1 * A2]',
    '[G2] Entrada de Estoque = MAX[0, F2 - E2]',
    '[H2] Saída de Estoque = MIN[0, F2 - E2]',
    '[I2] Requisito de estoque = [G2 - H2]',
    '[J2] Tranferências Saída = [L1 * B2]',
    '[L2] Requisito Total de Produção = [I2 + C2 + J2]',
    '[M2] Tranferências Entrada',
    '[N2] Produção Efetiva de Clínquer = MIN[L2,D2] + M2',
    '[N2.1] Produção Efetiva de Estoque Clínquer',      
    '[O2] % de Produção Própria = [N2 * (C2+I2)/(L2)]',
    '[P2] % de Produção Externa = [N2 * J2 /(L2)]',
    '[Q2] Estoque Final = [E2 + O2 - U2]',
    '[R2] Venda para outros Players',
    '[S2] Clínquer Dísponivel = [E2 + O2 - F2 + R2]',
    '[T2] Clínquer Dísponivel Convertido em Cimento',
    '[U2] Demanda Restrita de Clínquer = [S2/B2]',
    '[V2] Alerta de estoque Cimento',
    # Cimento Novamente
    '[A3] Produção efetiva de cimento = [O2/B2] trans. [N2/B2]',
    '[B3] Cimento disponível = M1',
    '[C3] Demanda restrita = MIN[B3,C1]',
    '[D3] Demanda não abastecida = [C1 - C3]',
    '[E3] Demanda irrestrita = C1'
    ])

In [ ]:
index

Index(['[A1] Dias Úteis', '[B1] Dias Cobertura Cimento',
       '[C1] Demanda Comercial de Cimento', '[D1] Capacidade Total Moinhos',
       '[E1] Estoque Inicial = [N1]',
       '[F1] Estoque de Segurança =  [C1/A1 * B1]',
       '[G1] Entrada de Estoque = MAX[0, F1 - E1]',
       '[H1] Saída de Estoque =  MIN[0, F1 - E1]',
       '[I1] Requisito de Estoque = [G1 + H1]',
       '[J1] Requisito Total de Produção = [J1 + C1]',
       '[L1] Produção Planejada de Cimento = MAX[J1,D1]',
       '[M1] Cimento Disponível = [E1 + A3 - F1]',
       '[N1] Estoque Final = [E1 + A3 - C3]', '[O1] Alerta de Estoque Cimento',
       '[A2] Dias Cobertura Clínquer', '[B2] Percentual de Clínquer',
       '[C2] Demanda de Clínquer para Cimento = [L1 * B2]',
       '[D2] Capacidade Total Fornos', '[E2] Estoque Inicial = [Q2]',
       '[F2] Estoque de Segurança = [C2/A1 * A2]',
       '[G2] Entrada de Estoque = MAX[0, F2 - E2]',
       '[H2] Saída de Estoque = MIN[0, F2 - E2]',
       '[I2] Requisito de estoque = [G2 - H2]',
       '[J2] Tranferências Saída = [L1 * B2]',
       '[L2] Requisito Total de Produção = [I2 + C2 + J2]',
       '[M2] Tranferências Entrada',
       '[N2] Produção Efetiva de Clínquer = MIN[L2,D2] + M2',
       '[N2.1] Produção Efetiva de Estoque Clínquer',
       '[O2] % de Produção Própria = [N2 * (C2+I2)/(L2)]',
       '[P2] % de Produção Externa = [N2 * J2 /(L2)]',
       '[Q2] Estoque Final = [E2 + O2 - U2]', '[R2] Venda para outros Players',
       '[S2] Clínquer Dísponivel = [E2 + O2 - F2 + R2]',
       '[T2] Clínquer Dísponivel Convertido em Cimento',
       '[U2] Demanda Restrita de Clínquer = [S2/B2]',
       '[V2] Alerta de estoque Cimento',
       '[A3] Produção efetiva de cimento = [O2/B2] trans. [N2/B2]',
       '[B3] Cimento disponível = M1', '[C3] Demanda restrita = MIN[B3,C1]',
       '[D3] Demanda não abastecida = [C1 - C3]',
       '[E3] Demanda irrestrita = C1'],
      dtype='object')

In [ ]:
# Criando um dionário com os valores do index

_index = index
_len = len(_index)
_dict = {}

for i in range(_len):
    _dict[_index[i]] = i

_dict

{'[A1] Dias Úteis': 0,
 '[B1] Dias Cobertura Cimento': 1,
 '[C1] Demanda Comercial de Cimento': 2,
 '[D1] Capacidade Total Moinhos': 3,
 '[E1] Estoque Inicial = [N1]': 4,
 '[F1] Estoque de Segurança =  [C1/A1 * B1]': 5,
 '[G1] Entrada de Estoque = MAX[0, F1 - E1]': 6,
 '[H1] Saída de Estoque =  MIN[0, F1 - E1]': 7,
 '[I1] Requisito de Estoque = [G1 + H1]': 8,
 '[J1] Requisito Total de Produção = [J1 + C1]': 9,
 '[L1] Produção Planejada de Cimento = MAX[J1,D1]': 10,
 '[M1] Cimento Disponível = [E1 + A3 - F1]': 11,
 '[N1] Estoque Final = [E1 + A3 - C3]': 12,
 '[O1] Alerta de Estoque Cimento': 13,
 '[A2] Dias Cobertura Clínquer': 14,
 '[B2] Percentual de Clínquer': 15,
 '[C2] Demanda de Clínquer para Cimento = [L1 * B2]': 16,
 '[D2] Capacidade Total Fornos': 17,
 '[E2] Estoque Inicial = [Q2]': 18,
 '[F2] Estoque de Segurança = [C2/A1 * A2]': 19,
 '[G2] Entrada de Estoque = MAX[0, F2 - E2]': 20,
 '[H2] Saída de Estoque = MIN[0, F2 - E2]': 21,
 '[I2] Requisito de estoque = [G2 - H2]': 22,
 '[J2] Tranferências Saída = [L1 * B2]': 23,
 '[L2] Requisito Total de Produção = [I2 + C2 + J2]': 24,
 '[M2] Tranferências Entrada': 25,
 '[N2] Produção Efetiva de Clínquer = MIN[L2,D2] + M2': 26,
 '[N2.1] Produção Efetiva de Estoque Clínquer': 27,
 '[O2] % de Produção Própria = [N2 * (C2+I2)/(L2)]': 28,
 '[P2] % de Produção Externa = [N2 * J2 /(L2)]': 29,
 '[Q2] Estoque Final = [E2 + O2 - U2]': 30,
 '[R2] Venda para outros Players': 31,
 '[S2] Clínquer Dísponivel = [E2 + O2 - F2 + R2]': 32,
 '[T2] Clínquer Dísponivel Convertido em Cimento': 33,
 '[U2] Demanda Restrita de Clínquer = [S2/B2]': 34,
 '[V2] Alerta de estoque Cimento': 35,
 '[A3] Produção efetiva de cimento = [O2/B2] trans. [N2/B2]': 36,
 '[B3] Cimento disponível = M1': 37,
 '[C3] Demanda restrita = MIN[B3,C1]': 38,
 '[D3] Demanda não abastecida = [C1 - C3]': 39,
 '[E3] Demanda irrestrita = C1': 40}

In [ ]:
current_path = os.getcwd()
current_path

'c:\\Users\\alexsandro.ignacio\\OneDrive - WCA Soluções de Inteligência Comercial\\Documentos\\Docs\\Git\\python_developer\\Planejamento - Lógicas'

In [ ]:
_directory_name = 'Data Base'
_file_name = 'Analise_de_Capacidade_base _ 2022-02-25-12-16-27.csv'

In [ ]:
target_path = os.path.join(current_path, _directory_name, _file_name)
target_path

'c:\\Users\\alexsandro.ignacio\\OneDrive - WCA Soluções de Inteligência Comercial\\Documentos\\Docs\\Git\\python_developer\\Planejamento - Lógicas\\Data Base\\Analise_de_Capacidade_base _ 2022-02-25-12-16-27.csv'

In [ ]:
_df = pd.read_csv(target_path,sep=';')
_df.head(1)

,indice_relatorio_analise_de_capacidades,index_codigo_unidade,index_datas,Relatórios de Analise de Capacidade
0,[A1] Dias Úteis,API,2021-06,23.0

In [ ]:
_df = _df.rename(columns={'indice_relatorio_analise_de_capacidades':'Relatórios de Análise de Capacidade', 
                          'index_codigo_unidade':'Código Unidades', 
                          'index_datas':'Datas', 
                          'Relatórios de Analise de Capacidade':'values'}).replace('-',0)

_df.head(2)

  Relatórios de Análise de Capacidade Código Unidades    Datas values
0                     [A1] Dias Úteis             API  2021-06   23.0
1                     [A1] Dias Úteis             API  2021-07   24.5

In [ ]:
_df.dtypes

Relatórios de Análise de Capacidade    object
Código Unidades                        object
Datas                                  object
values                                 object
dtype: object

In [ ]:
_df['Datas'] = pd.to_datetime(_df['Datas'])
_df['values'] = _df['values'].astype(float)
_df2 = _df
_df.dtypes

Relatórios de Análise de Capacidade            object
Código Unidades                                object
Datas                                  datetime64[ns]
values                                        float64
dtype: object

In [ ]:
# Tabela Normal
dicionario_ordem_relatorio = _dict

_df = _df.pivot_table(index=['Código Unidades','Relatórios de Análise de Capacidade'], columns='Datas', values='values')

_df = _df.reset_index().sort_values(['Código Unidades', 'Relatórios de Análise de Capacidade'])

_df['Ordem'] = _df['Relatórios de Análise de Capacidade']
_df['Ordem']  = _df['Ordem'].map(dicionario_ordem_relatorio)
# # _df['Ordem'] = _df['Relatórios de Análise de Capacidade'].str.split(pat=' ').str[0]
# # _df['Ordem']  = _df['Ordem'].replace(dicionario_ordem_relatorio)


_df = _df.sort_values(['Código Unidades', 'Ordem'])
# #  _df.drop(columns='Ordem', inplace=True)

_df.head(2)

Datas,Código Unidades,Relatórios de Análise de Capacidade,2021-06-01 00:00:00,2021-07-01 00:00:00,2021-08-01 00:00:00,2021-09-01 00:00:00,2021-10-01 00:00:00,2021-11-01 00:00:00,2021-12-01 00:00:00,2022-01-01 00:00:00,...,2022-09-01 00:00:00,2022-10-01 00:00:00,2022-11-01 00:00:00,2022-12-01 00:00:00,2023-01-01 00:00:00,2023-02-01 00:00:00,2023-03-01 00:00:00,2023-04-01 00:00:00,2023-05-01 00:00:00,Ordem
0,API,[A1] Dias Úteis,23.0,24.5,24.0,23.0,22.50,22.00,23.50,23.0,...,23.0,22.5,22.0,0.0,0.0,0.0,0.0,0.0,0.0,0
3,API,[B1] Dias Cobertura Cimento,10.0,10.0,10.0,10.0,3.23,3.25,4.03,10.0,...,10.0,10.0,10.0,10.0,10.0,10.0,10.0,10.0,10.0,1

In [ ]:
# Tabela Dinâmica
_df2

,Relatórios de Análise de Capacidade,Código Unidades,Datas,values
0,[A1] Dias Úteis,API,2021-06-01,23.000000
1,[A1] Dias Úteis,API,2021-07-01,24.500000
2,[A1] Dias Úteis,API,2021-08-01,24.000000
3,[A1] Dias Úteis,API,2021-09-01,23.000000
4,[A1] Dias Úteis,API,2021-10-01,22.500000
...,...,...,...,...
9835,[E3] Demanda irrestrita = C1,SPA,2023-01-01,53605.599116
9836,[E3] Demanda irrestrita = C1,SPA,2023-02-01,46132.299512
9837,[E3] Demanda irrestrita = C1,SPA,2023-03-01,59553.953942
9838,[E3] Demanda irrestrita = C1,SPA,2023-04-01,52896.214562
9839,[E3] Demanda irrestrita = C1,SPA,2023-05-01,60986.508322

#### Exemplos para criar parte do json do formulário

In [ ]:
# Columns para Armar Form
_n = 1
_cols1 = ['{"type":"numeric", "field":' + f'"Period_{i:03d}"'  for i in range(1, 145)]
_cols2 = [", " + '"style":{"color":"#000", "backgroundColor": "#FFF8E3"}, ' + '"format":"0.00", ' + ' "header":' + f'"S{j}"' + ', "readOnly":false, ' + '"columnLength":5}'  for i in range(1, 25) for j in range( 1,7)] 

result = [_cols1[i] + _cols2[i] for i in range(len(_cols1))]
result[0], len(result)
result = [result[i].replace('"',"'") for i in range(len(result))]
# result[0]

In [ ]:
import json 

with open('json_data.json', 'w', encoding ='utf-8') as outfile:
    json.dump(result, outfile, ensure_ascii=False, indent=4)
    outfile.close()

In [ ]:
# Nested list comprehension tuple 

result = [f'{i,j}'for i, j in zip(range(1, 145), range(1, 7))]
result

['(1, 1)', '(2, 2)', '(3, 3)', '(4, 4)', '(5, 5)', '(6, 6)']

In [ ]:
# Nested list comprehension
matrix = [ f'{i, j}' for i in range(1,145) for j in range(1,7)]
matrix[0:2]

['(1, 1)', '(1, 2)']

In [ ]:
idx_temporal = ['2021-06', '2021-07', '2021-08', '2021-09', '2021-10', '2021-11', '2021-12', '2022-01', '2022-02', '2022-03', '2022-04', '2022-05', '2022-06', '2022-07', '2022-08', '2022-09', '2022-10', '2022-11', '2022-12', '2023-01', '2023-02', '2023-03', '2023-04', '2023-05']

In [ ]:
# Nested columns receive new index.
_df = pd.DataFrame({'label':idx_temporal})
_df['colspan'] = 6
_df.to_dict('record')
_df

C:\Users\ALEXSA~1.IGN\AppData\Local\Temp/ipykernel_6152/460194324.py:4: FutureWarning: Using short name for 'orient' is deprecated. Only the options: ('dict', list, 'series', 'split', 'records', 'index') will be used in a future version. Use one of the above to silence this warning.
  _df.to_dict('record')

      label  colspan
0   2021-06        6
1   2021-07        6
2   2021-08        6
3   2021-09        6
4   2021-10        6
5   2021-11        6
6   2021-12        6
7   2022-01        6
8   2022-02        6
9   2022-03        6
10  2022-04        6
11  2022-05        6
12  2022-06        6
13  2022-07        6
14  2022-08        6
15  2022-09        6
16  2022-10        6
17  2022-11        6
18  2022-12        6
19  2023-01        6
20  2023-02        6
21  2023-03        6
22  2023-04        6
23  2023-05        6

In [ ]:
# Nested columns receive new index.

idx_temporal.insert(0, 'Marcha Fornos')
_df = pd.DataFrame({'label':idx_temporal})
_df['colspan'] = 6
_df['colspan'][0] = 3
_df = _df.to_dict('record')
_df

C:\Users\ALEXSA~1.IGN\AppData\Local\Temp/ipykernel_6152/1003000312.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  _df['colspan'][0] = 3
C:\Users\ALEXSA~1.IGN\AppData\Local\Temp/ipykernel_6152/1003000312.py:7: FutureWarning: Using short name for 'orient' is deprecated. Only the options: ('dict', list, 'series', 'split', 'records', 'index') will be used in a future version. Use one of the above to silence this warning.
  _df = _df.to_dict('record')

[{'label': 'Marcha Fornos', 'colspan': 3},
 {'label': '2021-06', 'colspan': 6},
 {'label': '2021-07', 'colspan': 6},
 {'label': '2021-08', 'colspan': 6},
 {'label': '2021-09', 'colspan': 6},
 {'label': '2021-10', 'colspan': 6},
 {'label': '2021-11', 'colspan': 6},
 {'label': '2021-12', 'colspan': 6},
 {'label': '2022-01', 'colspan': 6},
 {'label': '2022-02', 'colspan': 6},
 {'label': '2022-03', 'colspan': 6},
 {'label': '2022-04', 'colspan': 6},
 {'label': '2022-05', 'colspan': 6},
 {'label': '2022-06', 'colspan': 6},
 {'label': '2022-07', 'colspan': 6},
 {'label': '2022-08', 'colspan': 6},
 {'label': '2022-09', 'colspan': 6},
 {'label': '2022-10', 'colspan': 6},
 {'label': '2022-11', 'colspan': 6},
 {'label': '2022-12', 'colspan': 6},
 {'label': '2023-01', 'colspan': 6},
 {'label': '2023-02', 'colspan': 6},
 {'label': '2023-03', 'colspan': 6},
 {'label': '2023-04', 'colspan': 6},
 {'label': '2023-05', 'colspan': 6}]

In [ ]:
# Nested columns receive new index.

idx_temporal.insert(0, 'Marcha Moinhos')
_df = pd.DataFrame({'label':idx_temporal})
_df['colspan'] = 6
_df['colspan'][0] = 3
_df = _df.to_dict('record')
_df

C:\Users\ALEXSA~1.IGN\AppData\Local\Temp/ipykernel_6152/4263571742.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  _df['colspan'][0] = 3
C:\Users\ALEXSA~1.IGN\AppData\Local\Temp/ipykernel_6152/4263571742.py:7: FutureWarning: Using short name for 'orient' is deprecated. Only the options: ('dict', list, 'series', 'split', 'records', 'index') will be used in a future version. Use one of the above to silence this warning.
  _df = _df.to_dict('record')

[{'label': 'Marcha Moinhos', 'colspan': 3},
 {'label': 'Marcha Fornos', 'colspan': 6},
 {'label': '2021-06', 'colspan': 6},
 {'label': '2021-07', 'colspan': 6},
 {'label': '2021-08', 'colspan': 6},
 {'label': '2021-09', 'colspan': 6},
 {'label': '2021-10', 'colspan': 6},
 {'label': '2021-11', 'colspan': 6},
 {'label': '2021-12', 'colspan': 6},
 {'label': '2022-01', 'colspan': 6},
 {'label': '2022-02', 'colspan': 6},
 {'label': '2022-03', 'colspan': 6},
 {'label': '2022-04', 'colspan': 6},
 {'label': '2022-05', 'colspan': 6},
 {'label': '2022-06', 'colspan': 6},
 {'label': '2022-07', 'colspan': 6},
 {'label': '2022-08', 'colspan': 6},
 {'label': '2022-09', 'colspan': 6},
 {'label': '2022-10', 'colspan': 6},
 {'label': '2022-11', 'colspan': 6},
 {'label': '2022-12', 'colspan': 6},
 {'label': '2023-01', 'colspan': 6},
 {'label': '2023-02', 'colspan': 6},
 {'label': '2023-03', 'colspan': 6},
 {'label': '2023-04', 'colspan': 6},
 {'label': '2023-05', 'colspan': 6}]

#### For examples

In [ ]:
valores_pares = range(0,50,2)
valores_impares = range(1,50,2)

for valor in valores_impares:    
    print(f"Ímpares: {valor}")

Ímpares: 1
Ímpares: 3
Ímpares: 5
Ímpares: 7
Ímpares: 9
Ímpares: 11
Ímpares: 13
Ímpares: 15
Ímpares: 17
Ímpares: 19
Ímpares: 21
Ímpares: 23
Ímpares: 25
Ímpares: 27
Ímpares: 29
Ímpares: 31
Ímpares: 33
Ímpares: 35
Ímpares: 37
Ímpares: 39
Ímpares: 41
Ímpares: 43
Ímpares: 45
Ímpares: 47
Ímpares: 49

In [ ]:
from random import sample
from random import shuffle

valores_pares = list(range(0,50,2))
valores_impares = list(range(1,50,2))
shuffle(valores_pares)
shuffle(valores_impares)
print(valores_pares + valores_impares)

newlist = sample(valores_pares, len(valores_pares))
valores = valores_pares + valores_impares
shuffle(valores)
valores

[f"{'Ímpar' if valor % 2 != 0  else 'Par'}: {valor}" for valor in valores ]

[38, 0, 46, 16, 14, 36, 22, 2, 48, 26, 20, 24, 42, 40, 10, 32, 4, 12, 30, 34, 6, 8, 18, 28, 44, 49, 13, 45, 35, 33, 3, 23, 37, 25, 15, 31, 41, 1, 5, 21, 19, 27, 29, 39, 7, 9, 43, 17, 11, 47]

['Ímpar: 41',
 'Par: 30',
 'Ímpar: 49',
 'Ímpar: 15',
 'Par: 8',
 'Par: 4',
 'Ímpar: 27',
 'Par: 44',
 'Par: 36',
 'Ímpar: 11',
 'Ímpar: 35',
 'Ímpar: 9',
 'Par: 14',
 'Ímpar: 3',
 'Ímpar: 37',
 'Par: 12',
 'Par: 34',
 'Ímpar: 21',
 'Ímpar: 7',
 'Par: 40',
 'Par: 26',
 'Par: 46',
 'Ímpar: 25',
 'Par: 32',
 'Par: 24',
 'Par: 6',
 'Ímpar: 19',
 'Par: 10',
 'Par: 16',
 'Par: 18',
 'Par: 48',
 'Par: 28',
 'Par: 42',
 'Par: 0',
 'Ímpar: 1',
 'Par: 22',
 'Ímpar: 43',
 'Par: 38',
 'Ímpar: 13',
 'Ímpar: 31',
 'Ímpar: 45',
 'Ímpar: 17',
 'Par: 2',
 'Ímpar: 29',
 'Ímpar: 39',
 'Ímpar: 33',
 'Par: 20',
 'Ímpar: 23',
 'Ímpar: 47',
 'Ímpar: 5']

In [ ]:
data  = {'Coluna1':['Regional 1', 'Regional 2', ''],  'Coluna2':['Região Leste', 'Região Norte', ''], 'Coluna3':['Atacado', 'Atacado', ''], 'vol_dia':[10000, 500, 562]}
_df = pd.DataFrame(data)
_df

      Coluna1       Coluna2  Coluna3  vol_dia
0  Regional 1  Região Leste  Atacado    10000
1  Regional 2  Região Norte  Atacado      500
2                                         562

In [ ]:
new_columns = ['Região', 'Código Região']
for i in range(len(new_columns)):
    _df[new_columns[i]] = _df['Coluna1'].str.split(' ', expand=True)[i] 
    
_df

      Coluna1       Coluna2  Coluna3  vol_dia    Região Código Região
0  Regional 1  Região Leste  Atacado    10000  Regional             1
1  Regional 2  Região Norte  Atacado      500  Regional             2
2                                         562                    None

#### OS Comands

In [ ]:
# pega o caminho atual do root até o diretório atual.
current_path = os.getcwd()
current_path

'c:\\Users\\alexsandro.ignacio\\OneDrive - WCA Soluções de Inteligência Comercial\\Documentos\\Docs\\Git\\python_developer\\Planejamento - Lógicas'

In [ ]:
# Lista os files no diretório atual
os.listdir(current_path)

['criando_pkl.ipynb',
 'Data Base',
 'export_files.ipynb',
 'Json Examples by Project',
 'json_data.json',
 'json_teste.py',
 'logicas_pyplan.ipynb',
 'pp_functions.ipynb',
 'Xarray']

In [ ]:
_directory_name = 'Data Base'
_file_name = 'Analise_de_Capacidade_base _ 2022-02-25-12-16-27.csv'

# Concatena um path + diretório e file.
target_path = os.path.join(current_path, _directory_name, _file_name)
target_path

'c:\\Users\\alexsandro.ignacio\\OneDrive - WCA Soluções de Inteligência Comercial\\Documentos\\Docs\\Git\\python_developer\\Planejamento - Lógicas\\Data Base\\Analise_de_Capacidade_base _ 2022-02-25-12-16-27.csv'

#### Criando Linhas

In [ ]:
_df_aux = _df.copy()
_df_aux.columns = ['Cálculo', 'Valores']
_df_aux.loc[0] = ['Total Dias',  _df.loc[0][0]]
_df_aux.loc[1] = ['Total Horas',  _df.loc[0][1]]

In [ ]:
_cols1 = [f"Period_{i:03d}" for i in range(1, 145)]
_cols2 = [ f"-S{j}"  for i in range(1, 25) for j in range( 1,7)] 

[_cols1[i] + _cols2[i] for i in range(len(_cols1))]

['Period_001-S1',
 'Period_002-S2',
 'Period_003-S3',
 'Period_004-S4',
 'Period_005-S5',
 'Period_006-S6',
 'Period_007-S1',
 'Period_008-S2',
 'Period_009-S3',
 'Period_010-S4',
 'Period_011-S5',
 'Period_012-S6',
 'Period_013-S1',
 'Period_014-S2',
 'Period_015-S3',
 'Period_016-S4',
 'Period_017-S5',
 'Period_018-S6',
 'Period_019-S1',
 'Period_020-S2',
 'Period_021-S3',
 'Period_022-S4',
 'Period_023-S5',
 'Period_024-S6',
 'Period_025-S1',
 'Period_026-S2',
 'Period_027-S3',
 'Period_028-S4',
 'Period_029-S5',
 'Period_030-S6',
 'Period_031-S1',
 'Period_032-S2',
 'Period_033-S3',
 'Period_034-S4',
 'Period_035-S5',
 'Period_036-S6',
 'Period_037-S1',
 'Period_038-S2',
 'Period_039-S3',
 'Period_040-S4',
 'Period_041-S5',
 'Period_042-S6',
 'Period_043-S1',
 'Period_044-S2',
 'Period_045-S3',
 'Period_046-S4',
 'Period_047-S5',
 'Period_048-S6',
 'Period_049-S1',
 'Period_050-S2',
 'Period_051-S3',
 'Period_052-S4',
 'Period_053-S5',
 'Period_054-S6',
 'Period_055-S1',
 'Period_056-S2',
 'Period_057-S3',
 'Period_058-S4',
 'Period_059-S5',
 'Period_060-S6',
 'Period_061-S1',
 'Period_062-S2',
 'Period_063-S3',
 'Period_064-S4',
 'Period_065-S5',
 'Period_066-S6',
 'Period_067-S1',
 'Period_068-S2',
 'Period_069-S3',
 'Period_070-S4',
 'Period_071-S5',
 'Period_072-S6',
 'Period_073-S1',
 'Period_074-S2',
 'Period_075-S3',
 'Period_076-S4',
 'Period_077-S5',
 'Period_078-S6',
 'Period_079-S1',
 'Period_080-S2',
 'Period_081-S3',
 'Period_082-S4',
 'Period_083-S5',
 'Period_084-S6',
 'Period_085-S1',
 'Period_086-S2',
 'Period_087-S3',
 'Period_088-S4',
 'Period_089-S5',
 'Period_090-S6',
 'Period_091-S1',
 'Period_092-S2',
 'Period_093-S3',
 'Period_094-S4',
 'Period_095-S5',
 'Period_096-S6',
 'Period_097-S1',
 'Period_098-S2',
 'Period_099-S3',
 'Period_100-S4',
 'Period_101-S5',
 'Period_102-S6',
 'Period_103-S1',
 'Period_104-S2',
 'Period_105-S3',
 'Period_106-S4',
 'Period_107-S5',
 'Period_108-S6',
 'Period_109-S1',
 'Period_110-S2',
 'Period_111-S3',
 'Period_112-S4',
 'Period_113-S5',
 'Period_114-S6',
 'Period_115-S1',
 'Period_116-S2',
 'Period_117-S3',
 'Period_118-S4',
 'Period_119-S5',
 'Period_120-S6',
 'Period_121-S1',
 'Period_122-S2',
 'Period_123-S3',
 'Period_124-S4',
 'Period_125-S5',
 'Period_126-S6',
 'Period_127-S1',
 'Period_128-S2',
 'Period_129-S3',
 'Period_130-S4',
 'Period_131-S5',
 'Period_132-S6',
 'Period_133-S1',
 'Period_134-S2',
 'Period_135-S3',
 'Period_136-S4',
 'Period_137-S5',
 'Period_138-S6',
 'Period_139-S1',
 'Period_140-S2',
 'Period_141-S3',
 'Period_142-S4',
 'Period_143-S5',
 'Period_144-S6']

#### Select excludings sets

In [30]:
_df

   id  col1  col2  col3  col4  col5  col6
0   0     1     2     3     1     2     3
1   1     8     3     0     1     2     8
2   2     9     3     0     5     2     4
3   3     2     3     0     9     6     8

In [32]:
# drop by Name
df1 = _df.drop(['col1', 'col2'], axis=1)
df1

   id  col3  col4  col5  col6
0   0     3     1     2     3
1   1     0     1     2     8
2   2     0     5     2     4
3   3     0     9     6     8

In [33]:
_df.columns.difference(['col1', 'col2'])

Index(['col3', 'col4', 'col5', 'col6', 'id'], dtype='object')

In [34]:
import numpy as np
import pandas as pd

# Create a dataframe with columns A,B,C and D
df = pd.DataFrame(np.random.randn(100, 4), columns=list('ABCD'))

# include the columns you want
df[df.columns[df.columns.isin(['A', 'B'])]]

# or more simply include columns:
df[['A', 'B']]

# exclude columns you don't want
df[df.columns[~df.columns.isin(['C','D'])]]

# or even simpler since 0.24
# with the caveat that it reorders columns alphabetically 
df[df.columns.difference(['C', 'D'])]

           A         B
0  -1.910876 -2.468999
1  -0.276617  0.645848
2  -0.181742  0.196016
3  -0.823990  0.679115
4   0.551116  0.569710
..       ...       ...
95  1.241761  0.032117
96  1.127015  0.591906
97 -0.240710  1.065770
98 -0.372452  1.034823
99  1.893612 -0.405868

[100 rows x 2 columns]

In [35]:
# Create a dataframe with columns A,B,C and D
df = pd.DataFrame(np.random.randn(100, 4), columns=list('ABCD'))

In [36]:
cols = [col for col in df.columns if col not in ['B', 'D']]
df2 = df[cols]

##### link: https://stackoverflow.com/questions/14940743/selecting-excluding-sets-of-columns-in-pandas